// data/mealTemplates.js

const mealTemplates = {
    weightLoss: {
      breakfast: [
        "بيض + توست أسمر + لوز",
        "شوفان + حليب خالي الدسم + بيض + لوز",
      ],
      lunch: [
        "رز + دجاج + خضروات",
        "رز + سمك + خضروات",
      ],
      snack: [
        "بطاطس مسلوقة + دجاج",
        "سلطة + تونة",
      ],
      dinner: ["موز + زبادي يوناني"],
      preWorkout: ["كوب قهوة بدون حليب"],
    },
    maintenance: {
      breakfast: [
        "بيض + توست أسمر + جبن قريش",
        "شوفان + زبادي + مكسرات",
      ],
      lunch: [
        "رز + دجاج + خضار",
        "مكرونة + لحم مفروم + سلطة",
      ],
      snack: ["فواكه مشكلة", "حفنة مكسرات"],
      dinner: ["زبادي + خيار", "بيض مسلوق + خضار"],
      preWorkout: ["قهوة + تمرة"],
    },
    weightGain: {
      breakfast: [
        "بيض + توست + أفوكادو",
        "شوفان + زبدة فول سوداني + موز",
      ],
      lunch: [
        "رز + دجاج + خضار + زيت زيتون",
        "مكرونة + لحم + جبن",
      ],
      snack: [
        "بطاطس + صدر دجاج",
        "سندويتش تونة + خضار",
      ],
      dinner: ["زبادي + عسل + مكسرات"],
      preWorkout: ["قهوة + موز"],
    },
  };
  
  export default mealTemplates;